kaifanzheng/STM32EncryptedCommunication/ProjectFile(EncryptedCommunication)/Src/main.c
	uint32_t counter = 0;
	printToScreen("Connecting..");
	uint8_t isGot = 0;
	srand(time(NULL));
	while(1){
		char keyPadReading = getOneCharFromKeypad();
		if(keyPadReading == 'A'){
			ExitToMain();
			break;
		}
		uint8_t timeOut[4] = {50,100,150,200};
		uint8_t getBuffer[32];
		clearBufferString(getBuffer,32);
		HAL_UART_Init(&huart4);
		HAL_UART_Transmit(&huart4,(uint8_t *)publicIndexs,32 , 100);
		HAL_UART_Init(&huart4);
		HAL_UART_Receive(&huart4, getBuffer,32 ,(timeOut[RandomNumberGenerator(0,4)]));
		if(getBuffer[0] != 0){
			clearScreen();
			printToScreen("Initializing..");
			printToScreen(" ");
			printToScreen("message got:");
			printToScreen(getBuffer);
			isGot = 1;
			break;
		}
	}
	printToScreen("transmitting..");
	while(isGot){
		char keyPadReading = getOneCharFromKeypad();
		if(keyPadReading == 'A'){
			ExitToMain();
			break;
		}

		HAL_UART_Init(&huart4);
		HAL_UART_Transmit(&huart4,(uint8_t *)publicIndexs,32 , 100);
	}

}
void sendMessagePage(){
	//init for buffer sending
	const int sendBufferMaxSize = 15;
	uint8_t sendBuffer[sendBufferMaxSize];
	int BufferLen = 0;
	clearBufferString(sendBuffer,sendBufferMaxSize);

	printToScreen("send Message");
	while(1){
		char keyPadReading = getOneCharFromKeypad();
		if(keyPadReading == 'A'){
			ExitToMain();
			break;
		}
		HAL_Delay(100);
		//
		if(keyPadReading == '#'){
			HAL_UART_Init(&huart4);
			HAL_UART_Transmit(&huart4, sendBuffer,sendBufferMaxSize , 10000);
			clearScreen();
			clearBufferString(sendBuffer,sendBufferMaxSize);
			BufferLen = 0;
			printToScreen("send Message");
		}

		if((keyPadReading != 'n') && (BufferLen <= 14) && (keyPadReading != '#')&&(keyPadReading != '*')){
			sendBuffer[BufferLen] = keyPadReading;
			BufferLen += 1;
			clearScreen();
			printToScreen("send Message");
			printToScreen(" ");
			printToScreen((char *)sendBuffer);
		}

	}
}
void getMessagePage(){
	uint8_t getBuffer[15];
	uint8_t getBufferPrev[15];
	printToScreen("get Message");
	uint8_t quit = 1;
	while(quit){
		HAL_Delay(5);
		//TODO
		hardcopy_char(getBuffer,15,getBufferPrev);
		clearBufferString(getBuffer,15);
		while(getBuffer[0] == 0){
			HAL_UART_Init(&huart4);
			HAL_UART_Receive(&huart4,getBuffer, 15, 100);
			HAL_Delay(10);
			if(getOneCharFromKeypad() == 'A'){
				quit = 0;
				break;
			}
		}
		if(strcmp((char *)getBuffer,(char *)getBufferPrev)!=0){
			clearScreen();
			printToScreen("get Message");
			printToScreen(" ");
			printToScreen((char *)getBuffer);
		}
	}
	ExitToMain();
}
void testSpeakerPage(){
	printToScreen("testing speaker");
	printToScreen(" ");
	printToScreen("press A exit");
	while(1){
		if(getOneCharFromKeypad() == 'A'){
			ExitToMain();
			break;
		}
		play_ringtone();
		HAL_Delay(100);
	}
}
void getTemperaturePage(){
	float tem =0;
	float hum =0;
	float temp = 0;
	float hump = 0;
	while(1){
		if(getOneCharFromKeypad() == 'A'){
			ExitToMain();
			break;
		}
		HAL_Delay(100);
		temp = tem;
		hump = hum;
		tem = read_temperature();
		hum = read_humidity();
		if(temp != tem || hump != hum){
			clearScreen();
			char temBuf[15];
			char humBuf[15];
			gcvt(tem, 8, temBuf);
			gcvt(hum, 8, humBuf);
			printToScreen("t and h are:");
			printToScreen("");
			printToScreen(temBuf);
			printToScreen( humBuf);

		}
	}
}

void enterPageMainPage(){
	  clearScreen();
	  if(mainMenuPage == 0){
		  wifiOptionPage();
	  }else if(mainMenuPage == 1){
		  sendMessagePage();
	  }else if(mainMenuPage == 2){
		  getMessagePage();
	  }else if(mainMenuPage == 3){
		  testSpeakerPage();
	  }else if(mainMenuPage == 4){
		  getTemperaturePage();
	  }
}

void UILogic(){
	char keypadInputMain = getOneCharFromKeypad();
	if(keypadInputMain == '1'){
		if(mainMenuPage>0){
			mainMenuPage -= 1;
			changePageMainPage();
		}
	}else if(keypadInputMain == '3'){
		if(mainMenuPage<4){
			mainMenuPage += 1;
			changePageMainPage();
		}
	}else if(keypadInputMain == 'A'){
		HAL_Delay(100);
		enterPageMainPage();
	}
}

//test for data transfer----
void testSend(){
	//HAL_UART_Init(&huart4);
	uint8_t buf[5];
	uint8_t counter = 0;
	while(1){
		clearBufferString(buf,5);
		if(counter % 2 == 0){
			sprintf(buf, "hello");
			HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
			printToScreen("sent hello");
		}else{
			sprintf(buf, "happy");
			HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
			printToScreen("sent happy");
		}
//		sprintf(buf, "hello");
//		HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
		counter = (counter+1)%4;
		HAL_Delay(2000);
	}
}


void testGet(){
	//HAL_UART_Init(&huart4);
	uint8_t buf[5];
	while(1){
//		printToScreen("start to get:");
//		printToScreen("");
		clearBufferString(buf,5);
		HAL_UART_Receive(&huart4, (uint8_t*) buf, (uint16_t) 5, 10000);
		printToScreen((char *) buf);
		HAL_Delay(1000);
	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_DAC1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_OCTOSPI1_Init();
  MX_I2C1_Init();
  MX_SPI3_Init();
  MX_UART4_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */

  // Testssd1306Driver();
  // generate_ringtone(ringtone_note_1, ringtone_note_2, ringtone_note_3, ringtone_note_4);
  generate_ringtone(ringtone, 1);
  HAL_TIM_Base_Start_IT(&htim2);
  BSP_HSENSOR_Init();
  BSP_TSENSOR_Init();
  HAL_UART_Init(&huart4);
  // play_ringtone();
  play_ringtone();
  //initeScreen and UI
  InitScreen();
  displayMainPageOne();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  float t;
  float h;
  while (1)
  {
	  t = read_temperature();
	  h = read_humidity();
	  //testKeypadDriver();
	  //testOLEDScreenDriverPrint();
	  //testCryotoSystem();
	  //testSend();
	  //testGet();
	  //take keypad input to flip page

